7767517
149 175
Input                    in0                      0 1 in0
Convolution              conv_3                   1 1 in0 1 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1728
Swish                    silu_52                  1 1 1 2
Convolution              conv_4                   1 1 2 3 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_53                  1 1 3 4
Convolution              conv_5                   1 1 4 5 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_54                  1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,64,64 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_6                   1 1 11 12 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_55                  1 1 12 13
Split                    splitncnn_1              1 2 13 14 15
Convolution              conv_7                   1 1 15 16 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_56                  1 1 16 17
Convolution              conv_8                   1 1 17 18 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_57                  1 1 18 19
BinaryOp                 add_0                    2 1 14 19 20 0=0
Split                    splitncnn_2              1 2 20 21 22
Convolution              conv_9                   1 1 22 23 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_58                  1 1 23 24
Convolution              conv_10                  1 1 24 25 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_59                  1 1 25 26
BinaryOp                 add_1                    2 1 21 26 27 0=0
Convolution              conv_11                  1 1 10 28 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_60                  1 1 28 29
Concat                   cat_0                    2 1 27 29 30 0=0
Convolution              conv_12                  1 1 30 31 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_61                  1 1 31 32
Concat                   cat_1                    3 1 7 9 32 33 0=0
Convolution              conv_13                  1 1 33 34 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_62                  1 1 34 35
Convolution              conv_14                  1 1 35 36 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Swish                    silu_63                  1 1 36 37
Convolution              conv_15                  1 1 37 38 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_64                  1 1 38 39
Slice                    split_1                  1 2 39 40 41 -23300=2,128,128 1=0
Split                    splitncnn_3              1 3 41 42 43 44
Convolution              conv_16                  1 1 44 45 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_65                  1 1 45 46
Split                    splitncnn_4              1 2 46 47 48
Convolution              conv_17                  1 1 48 49 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_66                  1 1 49 50
Convolution              conv_18                  1 1 50 51 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_67                  1 1 51 52
BinaryOp                 add_2                    2 1 47 52 53 0=0
Split                    splitncnn_5              1 2 53 54 55
Convolution              conv_19                  1 1 55 56 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_68                  1 1 56 57
Convolution              conv_20                  1 1 57 58 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_69                  1 1 58 59
BinaryOp                 add_3                    2 1 54 59 60 0=0
Convolution              conv_21                  1 1 43 61 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_70                  1 1 61 62
Concat                   cat_2                    2 1 60 62 63 0=0
Convolution              conv_22                  1 1 63 64 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_71                  1 1 64 65
Concat                   cat_3                    3 1 40 42 65 66 0=0
Convolution              conv_23                  1 1 66 67 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
Swish                    silu_72                  1 1 67 68
Convolution              conv_24                  1 1 68 69 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2359296
Swish                    silu_73                  1 1 69 70
Convolution              conv_25                  1 1 70 71 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_74                  1 1 71 72
Slice                    split_2                  1 2 72 73 74 -23300=2,256,256 1=0
Split                    splitncnn_6              1 3 74 75 76 77
Convolution              conv_26                  1 1 77 78 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_75                  1 1 78 79
Split                    splitncnn_7              1 2 79 80 81
Convolution              conv_27                  1 1 81 82 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_76                  1 1 82 83
Convolution              conv_28                  1 1 83 84 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_77                  1 1 84 85
BinaryOp                 add_4                    2 1 80 85 86 0=0
Split                    splitncnn_8              1 2 86 87 88
Convolution              conv_29                  1 1 88 89 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_78                  1 1 89 90
Convolution              conv_30                  1 1 90 91 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_79                  1 1 91 92
BinaryOp                 add_5                    2 1 87 92 93 0=0
Convolution              conv_31                  1 1 76 94 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_80                  1 1 94 95
Concat                   cat_4                    2 1 93 95 96 0=0
Convolution              conv_32                  1 1 96 97 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_81                  1 1 97 98
Concat                   cat_5                    3 1 73 75 98 99 0=0
Convolution              conv_33                  1 1 99 100 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_82                  1 1 100 101
Convolution              conv_34                  1 1 101 102 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2359296
Swish                    silu_83                  1 1 102 103
Convolution              conv_35                  1 1 103 104 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_84                  1 1 104 105
Slice                    split_3                  1 2 105 106 107 -23300=2,256,256 1=0
Split                    splitncnn_9              1 3 107 108 109 110
Convolution              conv_36                  1 1 110 111 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_85                  1 1 111 112
Split                    splitncnn_10             1 2 112 113 114
Convolution              conv_37                  1 1 114 115 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_86                  1 1 115 116
Convolution              conv_38                  1 1 116 117 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_87                  1 1 117 118
BinaryOp                 add_6                    2 1 113 118 119 0=0
Split                    splitncnn_11             1 2 119 120 121
Convolution              conv_39                  1 1 121 122 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_88                  1 1 122 123
Convolution              conv_40                  1 1 123 124 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_89                  1 1 124 125
BinaryOp                 add_7                    2 1 120 125 126 0=0
Convolution              conv_41                  1 1 109 127 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_90                  1 1 127 128
Concat                   cat_6                    2 1 126 128 129 0=0
Convolution              conv_42                  1 1 129 130 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_91                  1 1 130 131
Concat                   cat_7                    3 1 106 108 131 132 0=0
Convolution              conv_43                  1 1 132 133 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_92                  1 1 133 134
Convolution              conv_44                  1 1 134 135 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_93                  1 1 135 136
Slice                    split_4                  1 2 136 137 138 -23300=2,256,256 1=0
Split                    splitncnn_12             1 2 138 139 140
Convolution              conv_45                  1 1 140 141 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Reshape                  view_99                  1 1 141 142 0=49 1=128 2=4
Slice                    split_5                  1 3 142 143 144 145 -23300=3,32,32,64 1=1
Split                    splitncnn_13             1 2 145 146 147
Permute                  transpose_104            1 1 143 148 0=1
MatMul                   matmul_102               2 1 148 144 149
BinaryOp                 mul_8                    1 1 149 150 0=2 1=1 2=1.767767e-01
Softmax                  softmax_0                1 1 150 151 0=2 1=1
MatMul                   matmultransb_0           2 1 147 151 152 0=1
Reshape                  view_100                 1 1 152 153 0=7 1=7 2=256
Reshape                  reshape_97               1 1 146 154 0=7 1=7 2=256
ConvolutionDepthWise     convdw_106               1 1 154 155 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
BinaryOp                 add_9                    2 1 153 155 156 0=0
Convolution              conv_46                  1 1 156 157 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_10                   2 1 139 157 158 0=0
Split                    splitncnn_14             1 2 158 159 160
Convolution              conv_47                  1 1 160 161 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_94                  1 1 161 162
Convolution              conv_48                  1 1 162 163 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_11                   2 1 159 163 164 0=0
Concat                   cat_8                    2 1 137 164 165 0=0
Convolution              conv_49                  1 1 165 166 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_95                  1 1 166 167
Convolution              conv_50                  1 1 167 168 0=1280 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=655360
Swish                    silu_96                  1 1 168 169
Pooling                  gap_2                    1 1 169 170 0=1 4=1
Reshape                  reshape_98               1 1 170 171 0=1 1=1 2=-1
Flatten                  flatten_101              1 1 171 172
InnerProduct             linear_51                1 1 172 173 0=2 1=1 2=2560
Softmax                  softmax_1                1 1 173 out0 0=0 1=1
